Repository: tupass/tupass-frontend
Catalog: src/locale/messages.*.xlf
Languages: de

# learnMoreTooltip
source: Learn more
de: Erfahre mehr

# inputPlaceholder
source: Enter a password to evaluate
de: Gib ein Passwort zur Evaluation ein

# tooLongInput
source: Your input is too long
de: Die Eingabe ist zu lang

# nonASCIICharsInside
source: Please remove the following non-ASCII-characters from your input: {{ getFaultyCharacters() }}
de: Bitte löschen Sie die folgenden nicht-ASCII-Zeichen aus der Eingabe: {{ getFaultyCharacters() }}

source: Invalid input
de: Ungültige Eingabe

# noConnection
source: Unable to process your request, please try again later. In the meantime, you can look at pictues of <a>these cute kittens</a>.
de: Leider konnte die Anfrage nicht bearbeitet werden. Versuche es später noch einmal. In der Zwischenzeit kannst Du dir Bilder von <a>diesen süßen Kätzchen</a> anschauen.

# strengthResult
source: Strength
de: Stärke

# lengthResult
source: Length
de: Länge

# complexityResult
source: Complexity
de: Komplexität

# unpredictabilityResult
source: Unpredictability
de: Unvorhersagbarkeit

# popoverStrengthResult
source: <p>This score represents the total strength of your password and is a combination of all metrics (length, complexity and predictability).</p> <p></p> <p><strong>General Hints:</strong></p> <ul> <li>Don't use sequences on your keyboard.</li> <li>Avoid using sequences of characters.</li> <li>Make sure nobody is looking over your shoulder.</li> </ul>
de: <p>Dieser Wert spiegelt die totale Stärke deines Passwortes wider und ist eine Kombination von allen Metriken (Länge, Komplexität und Vorhersagbarkeit).</p> <p></p> <p><strong>Generelle Hinweise:</strong></p> <ul> <li>Verwende keine Sequenzen auf der Tastatur.</li> <li>Vermeide es, Sequenzen von Zeichen wiederzuverwenden.</li> <li>Achte darauf, dass dir niemand über deine Schulter schaut.</li> </ul>

# popoverLengthResult
source: <p>This displays the strength of the password in terms of length.</p>
de: <p>Dies spiegelt die Stärke des Passwortes im Bezug auf die Länge wider.</p>

# popoverComplexityResult
source: <p>This score is calculated based on the character sets used.</p> <p>Examples of character sets are lowercase letters (abc), uppercase letters (XYZ), numbers (123) or symbols ($%&).</p>
de: <p>Dieser Wert wird basierend auf den genutzten Zeichensätzen berechnet.</p> <p>Verwendete Zeichensätze: Kleinbuchstaben (abc), Großbuchstaben (XYZ), Zahlen (123) oder Sonderzeichen ($%&).</p>

# popoverPredictabilityResult
source: <p>We compare the input with 50.000 common passwords. Is the input very similar to one of these passwords, it is easy to predict.</p> <p></p> <p><strong>Hints:</strong></p> <ul> <li>Avoid substitutions like '@' for 'a' or '$' for 's'.</li> <li>Don't use names, usernames or emails.</li> <li>Don't use dates or years.</li> </ul>
de: <p>Wir vergleichen die Eingabe mit 50.000 häufig genutzten Passwörtern. Ist die Eingabe sehr ähnlich zu einem dieser Passwörter, ist es einfach vorherzusagen.</p> <p></p> <p><strong>Hinweise:</strong></p> <ul> <li>Vermeide Substitutionen wie '@' für 'a' oder '$' für 's'.</li> <li>Nutze keine Namen, Nutzernamen oder Email-Adressen.</li> <li>Vermeide Datum und Jahrzahl.</li> </ul>

# downloadExplanation
source: This project is open source. You can find the code at <a>GitHub</a>.<br/> You can also find a local version <a>available for download there</a>.
de: Dieses Projekt ist Open Source. Den Code kannst du auf <a>GitHub</a> finden.<br/> Außerdem gibt es dort eine lokale Version <a>zum Download</a>.

# titleAboutPage
source: Rating Explained
de: Erklärung der Bewertung

source: Metrics Calculation
de: Berechnung der Metriken

# howCalculatedAboutPage
source: First, your entered password will be examined for three metrics:<br/>
de: Zuerst wird dein eingegebenes Passwort auf drei Metriken untersucht:<br/>

# expansionLengthAboutPage
source: <mat-expansion-panel-header> <mat-panel-title> 1. <b>Length</b> </mat-panel-title> </mat-expansion-panel-header> The password length simply is the number of characters of the input string. It is generally a good idea to use passwords as long as possible to prevent simple <a>Brute-Force Attacks</a>.<br/> Choosing a short password results in a poor rating because short passwords can be guessed with brute force.
de: <mat-expansion-panel-header> <mat-panel-title> 1. <b>Länge</b> </mat-panel-title> </mat-expansion-panel-header> Die Passwortlänge ist die Anzahl von Zeichen in der Eingabe. Generell ist es eine gute Idee möglichst lange Zeichenketten zu nutzen, um einfache <a>Brute-Force Attacken</a> zu verhindern.<br/> Wenn man ein kurzes Passwort wählt, resultiert dies in einer schlechten Bewertung, weil kurze Passwörter durch Brute-Force-Attacken geraten werden können.

# expansionComplexityAboutPage
source: <mat-expansion-panel-header> <mat-panel-title> 2. <b>Complexity</b> </mat-panel-title> </mat-expansion-panel-header> To calculate the password's complexity, our algorithm knows four different character classes: <b>Lowercase letters</b> (26 chars), <b>Uppercase letters</b> (26 chars), <b>Digit characters</b> (10 chars) and <b>Special characters</b> (33 chars).<br/> <br/> The algorithm calculates the number of possible character sets for the current length, taking the used character classes into account.<br/> For the complexity score this result is rewarded based on the number of character classes used.
de: <mat-expansion-panel-header> <mat-panel-title> 2. <b>Komplexität</b> </mat-panel-title> </mat-expansion-panel-header> Um die Komplexität des Passwortes zu berechnen, nutzt unser Algorithmus vier verschiedene Zeichensätze: <b>Kleinbuchstaben</b> (26 Zeichen), <b>Großbuchstaben</b> (26 Zeichen), <b>Ziffern</b> (10 Zeichen) und <b>Sonderzeichen</b> (33 Zeichen).<br/> <br/> Der Algorithmus berechnet die Anzahl von möglichen Zeichenkombinationen für die aktuelle Länge unter Einbeziehung der genutzten Zeichensätzen. <br/> Für den Wert der Komplexität wird das Ergebnis basierend auf der Anzahl von genutzten Zeichensätzen belohnt.

# expansionPredictabilityAboutPage
source: <mat-expansion-panel-header> <mat-panel-title> 3. <b>Predictability</b> </mat-panel-title> </mat-expansion-panel-header> A password will be predictable if it is similar to phrases in a common password list. We use a list of 50.000 common passwords. To get the predictability, we calculate the number of editing operations aka. <a>Levenshtein Distance</a> between the input and every entry of our password list. <br/> <br/> The calculation also recognizes <a>leetspeak</a> characters and replaces them in single-operation distance.<br/> This means that a string typed like <b>P@$$w0rd</b> will be similar to <b>password</b> and therefore not be considered secure.
de: <mat-expansion-panel-header> <mat-panel-title> 3. <b>Vorhersagbarkeit</b> </mat-panel-title> </mat-expansion-panel-header> Ein Passwort ist vorhersagbar, wenn es ähnlich zu einem Eintrag in einer Passwortliste mit oft verwendeten Passwörtern ist. Unsere Liste umfasst 50.000 Passwörter. Zur Bestimmung der Vorhersagbarkeit berechnen wir die Anzahl der Bearbeitungsoperationen aka. <a>Levenshtein Distanz</a> zwischen der Eingabe und jedem Eintrag in der Passwortliste. <br/> <br/> Die Berechung erkennt auch <a>Leetspeak</a>-Zeichen und ersetzt diese mit einer Distanz einer Einzeloperation.<br/> Dies bedeutet, dass eine Zeichenkette wie <b>P@$$w0rt</b> ähnlich zu <b>Passwort</b> ist, also nicht ausreichend sicher.

# finalComposation
source: Finally, the metrics will be graded and matched into predefined <b>strength-classes</b>.<br/>
de: Schlussendlich werden die Metriken bewertet und in vordefinierte <b>Stärkeklassen</b> eingeteilt.<br/>

# totalStrengthCalculationAboutPage
source: Total Strength Calculation
de: Berechnung der Gesamtstärke

# finalStep1ExplanationAboutPage
source: After all metrics have been graded, the password strength can be concluded with a predefined rule base.<br/>
de: Nachdem alle Metriken berechnet wurden, wird in einem finalen Schritt die Gesamtstärke der Eingabe mittels einer vordefinierten Regelmenge bestimmt.<br/>

# finalStep2ExplanationAboutPage
source: In most cases several conclusions can be drawn. All conclusions are weighted and added together. In the end a single strength value is returned that describes the overall strength of the entered password.<br/>
de: In den meisten Fällen können mehrere Schlussfolgerungen getroffen werden. Alle möglichen Schlussfolgerungen werden gewichtet und zusammen addiert. Am Schluss wird ein einzelnes Ergebnis angezeigt, welches die Gesamtstärke des Passwortes beschreibt.<br/>

# numberTableAboutPage
source: No.
de: Num.

# lengthTableAboutPage
source: Length
de: Länge

# complexityTableAboutPage
source: Complexity
de: Komplexität

# predictabilityTableAboutPage
source: Predictability
de: Vorhersagbarkeit

# classTableAboutPage
source: Classification (Password Strength)
de: Klassifikation (Passwortstärke)

# welcome
source: Welcome to TUPass!
de: Willkommen bei TUPass!

# noProvidingRealPasswords
source: Do not provide real passwords!
de: Nutze keine echten Passwörter!

# localVersionRunning
source: This is the local version running.
de: Dies ist die lokale Version.

# enterRealPasswords
source: <strong>Why you should not enter real passwords</strong>
de: <strong>Warum man keine richtigen Passwörter eingeben sollte.</strong>

# localVersionTitle
source: <strong>Local version</strong>
de: <strong>Lokale Version</strong>

# enterRealPasswordsContent
source: <p>It is very important to keep passwords secret. So you should only enter your password on sites you created the password for in the first place.</p> <p>Although we give our best to keep your input safe, it may be possible that third parties intercept your password.</p>
de: <p>Es ist sehr wichtig, Passwörter geheim zu halten. Gib deshalb reale Passwörter nur bei den Diensten ein, für welche diese erstellt wurden und genutzt werden.</p> <p>Auch wenn wir unser Bestes geben um die Eingabe zu sichern, könnte es Dritten möglich sein, an das Passwort zu gelangen.</p>

# localVersionContent
source: <p>You are currently running the local version of TUPass. This means the whole application runs on your system without Internet access.</p> <p>Please make sure that the address bar in your browser is pointing to <i>localhost:8000</i>.</p>
de: <p>Du benutzt aktuell die lokale Version von TUPass. Die ganze Anwendung läuft auf deinem System ohne Internet.</p> <p>Bitte stelle sicher, dass die Adressleiste <i>localhost:8000</i> anzeigt.</p>

source: Privacy Policy
de: Datenschutzerklärung

source: Legal Notes
de: Impressum
